mbrossard/DAPLink/source/hic_hal/infineon/psoc5lp/gcc/startup_CY8C5LP.S
/**
 * @file    startup_CY8C5LP.S
 * @brief   Startup File for CY8C5LP Device Series
 *
 * DAPLink Interface Firmware
 * Copyright (c) 2009-2023, ARM Limited, All Rights Reserved
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License"); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
    .syntax unified
    .arch armv7-m

    .section .isr_vector, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long    __StackTop            /* Top of Stack */
    .long    Reset_Handler         /* Reset Handler */
    .long    NMI_Handler           /* NMI Handler */
    .long    HardFault_Handler     /* Hard Fault Handler */
    .long    MemManage_Handler     /* MPU Fault Handler */
    .long    BusFault_Handler      /* Bus Fault Handler */
    .long    UsageFault_Handler    /* Usage Fault Handler */
    .long    0                     /* Reserved */
    .long    DAPLINK_BUILD_KEY     /* DAPLINK: Build type (BL/IF) */
    .long    DAPLINK_HIC_ID        /* DAPLINK: Compatibility */
    .long    DAPLINK_VERSION       /* DAPLINK: Version */
    .long    SVC_Handler           /* SVCall Handler */
    .long    DebugMon_Handler      /* Debug Monitor Handler */
    .long    g_board_info          /* DAPLINK: Pointer to board/family/target info */
    .long    PendSV_Handler        /* PendSV Handler */
    .long    SysTick_Handler       /* SysTick Handler */

/* External Interrupts */
    .long    WDT_IRQHandler           /* 0:  Watchdog Timer             */
    .long    RTC_IRQHandler           /* 1:  Real Time Clock            */
    .long    TIM0_IRQHandler          /* 2:  Timer0 / Timer1            */
    .long    TIM2_IRQHandler          /* 3:  Timer2 / Timer3            */
    .long    MCIA_IRQHandler          /* 4:  MCIa                       */
    .long    MCIB_IRQHandler          /* 5:  MCIb                       */
    .long    UART0_IRQHandler         /* 6:  UART0 - DUT FPGA           */
    .long    UART1_IRQHandler         /* 7:  UART1 - DUT FPGA           */
    .long    UART2_IRQHandler         /* 8:  UART2 - DUT FPGA           */
    .long    UART4_IRQHandler         /* 9:  UART4 - not connected      */
    .long    AACI_IRQHandler          /* 10: AACI / AC97                */
    .long    CLCD_IRQHandler          /* 11: CLCD Combined Interrupt    */
    .long    ENET_IRQHandler          /* 12: Ethernet                   */
    .long    USBDC_IRQHandler         /* 13: USB Device                 */
    .long    USBHC_IRQHandler         /* 14: USB Host Controller        */
    .long    CHLCD_IRQHandler         /* 15: Character LCD              */
    .long    FLEXRAY_IRQHandler       /* 16: Flexray                    */
    .long    CAN_IRQHandler           /* 17: CAN                        */
    .long    LIN_IRQHandler           /* 18: LIN                        */
    .long    I2C_IRQHandler           /* 19: I2C ADC/DAC                */
    .long    0                        /* 20: Reserved                   */
    .long    0                        /* 21: Reserved                   */
    .long    0                        /* 22: Reserved                   */
    .long    0                        /* 23: Reserved                   */
    .long    0                        /* 24: Reserved                   */
    .long    0                        /* 25: Reserved                   */
    .long    0                        /* 26: Reserved                   */
    .long    0                        /* 27: Reserved                   */
    .long    CPU_CLCD_IRQHandler      /* 28: Reserved - CPU FPGA CLCD   */
    .long    0                        /* 29: Reserved - CPU FPGA        */
    .long    UART3_IRQHandler         /* 30: UART3    - CPU FPGA        */
    .long    SPI_IRQHandler           /* 31: SPI Touchscreen - CPU FPGA */

    .size    __isr_vector, . - __isr_vector

    .text
    .thumb

/* Reset Handler */

    .thumb_func
    .align 2
    .globl   Reset_Handler
    .weak    Reset_Handler
    .type    Reset_Handler, %function
Reset_Handler:
    cpsid   i                    /* Mask interrupts */
    ldr      r0, =__StackTop
    mov      sp, r0
#ifndef __NO_SYSTEM_INIT
    ldr   r0,=SystemInit
    blx   r0
#endif
/*     Loop to copy data from read only memory to RAM. The ranges
 *      of copy from/to are specified by following symbols evaluated in
 *      linker script.
 *      __etext: End of code section, i.e., begin of data sections to copy from.
 *      __data_start__/__data_end__: RAM address range that data should be
 *      copied to. Both must be aligned to 4 bytes boundary.  */

    ldr    r1, =__etext
    ldr    r2, =__data_start__
    ldr    r3, =__data_end__

#if 1
/* Here are two copies of loop implemenations. First one favors code size
 * and the second one favors performance. Default uses the first one.
 * Change to "#if 0" to use the second one */
.LC0:
    cmp     r2, r3
    ittt    lt
    ldrlt   r0, [r1], #4
    strlt   r0, [r2], #4
    blt    .LC0
#else
    subs    r3, r2
    ble    .LC1
.LC0:
    subs    r3, #4
    ldr    r0, [r1, r3]
    str    r0, [r2, r3]
    bgt    .LC0
.LC1:
#endif

#ifdef __STARTUP_CLEAR_BSS
/*     This part of work usually is done in C library startup code. Otherwise,
 *     define this macro to enable it in this startup.
 *
 *     Loop to zero out BSS section, which uses following symbols
 *     in linker script:
 *      __bss_start__: start of BSS section. Must align to 4
 *      __bss_end__: end of BSS section. Must align to 4
 */
    ldr r1, =__bss_start__
    ldr r2, =__bss_end__

    movs    r0, 0
.LC2:
    cmp     r1, r2
    itt    lt
    strlt   r0, [r1], #4
    blt    .LC2
#endif /* __STARTUP_CLEAR_BSS */

    cpsie  i               /* Unmask interrupts */
    ldr    r0, =_start
    bx     r0
    .pool
    .size Reset_Handler, . - Reset_Handler

    .text
/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro    def_default_handler    handler_name
    .align 1
    .thumb_func
    .weak    \handler_name
    .type    \handler_name, %function
\handler_name :
    b    .
    .size    \handler_name, . - \handler_name
    .endm

    def_default_handler     NMI_Handler
    def_default_handler     HardFault_Handler
    def_default_handler     MemManage_Handler
    def_default_handler     BusFault_Handler
    def_default_handler     UsageFault_Handler
    def_default_handler     SVC_Handler
    def_default_handler     DebugMon_Handler
    def_default_handler     PendSV_Handler
    def_default_handler     SysTick_Handler
    def_default_handler     Default_Handler

    .macro    def_irq_handler    handler_name
    .weak     \handler_name
    .set      \handler_name, Default_Handler
    .endm

    def_irq_handler         WDT_IRQHandler
    def_irq_handler         RTC_IRQHandler
    def_irq_handler         TIM0_IRQHandler
    def_irq_handler         TIM2_IRQHandler
    def_irq_handler         MCIA_IRQHandler
    def_irq_handler         MCIB_IRQHandler
    def_irq_handler         UART0_IRQHandler
    def_irq_handler         UART1_IRQHandler
    def_irq_handler         UART2_IRQHandler
    def_irq_handler         UART3_IRQHandler
    def_irq_handler         UART4_IRQHandler
    def_irq_handler         AACI_IRQHandler
    def_irq_handler         CLCD_IRQHandler
    def_irq_handler         ENET_IRQHandler
    def_irq_handler         USBDC_IRQHandler
    def_irq_handler         USBHC_IRQHandler
    def_irq_handler         CHLCD_IRQHandler
    def_irq_handler         FLEXRAY_IRQHandler
    def_irq_handler         CAN_IRQHandler
    def_irq_handler         LIN_IRQHandler
    def_irq_handler         I2C_IRQHandler
    def_irq_handler         CPU_CLCD_IRQHandler
    def_irq_handler         SPI_IRQHandler

    .end
